# Convert a Categorical variable into Dummy variable

Source: https://chrisalbon.com/python/data_wrangling/pandas_convert_categorical_to_dummies/

In [2]:
import pandas as pd

In [4]:
# Create a data frame
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
            'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
            'sex': ['male', 'female', 'male', 'female', 'female']
           }
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'sex'])
df

  first_name last_name     sex
0      Jason    Miller    male
1      Molly  Jacobson  female
2       Tina       Ali    male
3       Jake    Milner  female
4        Amy     Cooze  female

In [6]:
# Create a set of dummy variables from the sex variable
df_sex = pd.get_dummies(df['sex'])
df_sex

   female  male
0       0     1
1       1     0
2       0     1
3       1     0
4       1     0

In [7]:
# Join the dummy variables to the main dataframe
df_new = pd.concat([df, df_sex], axis=1)
df_new

  first_name last_name     sex  female  male
0      Jason    Miller    male       0     1
1      Molly  Jacobson  female       1     0
2       Tina       Ali    male       0     1
3       Jake    Milner  female       1     0
4        Amy     Cooze  female       1     0

In [8]:
# Alternative for joining the new columns
df_new = df.join(df_sex)
df_new

  first_name last_name     sex  female  male
0      Jason    Miller    male       0     1
1      Molly  Jacobson  female       1     0
2       Tina       Ali    male       0     1
3       Jake    Milner  female       1     0
4        Amy     Cooze  female       1     0